Revit 2026 API
ModelPath Class
 A path to a file stored on a disk or on a server.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPath
 Autodesk.Revit.DB.FilePath
 Autodesk.Revit.DB.ServerPath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ModelPath : IDisposable
Public Class ModelPath
	Implements IDisposable
public ref class ModelPath : IDisposable
type ModelPath =
    class
        interface IDisposable
    end
The ModelPath type exposes the following members.
Properties
Name | Description
CentralServerPath |  The path to the location of the central Revit server or cloud.
CloudPath |  Whether this path represents a path on an Autodesk server such as BIM360.
Empty |  Whether this path is empty
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Region |  The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
ServerPath |  Whether this path is a server path (as opposed to a file path or cloud path)
Top
Methods
Name | Description
Compare |  Compares this ModelPath with another
Dispose | Releases all resources used by the ModelPath
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModelGUID |  A GUID identifying the Revit cloud model.
GetProjectGUID |  A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 ModelPaths are paths to another file. They can refer to Revit models, or to any of Revit's external file references (DWG links, for example.) Paths can be relative or absolute, but they must include an extension indicating what kind of file it is. Relative paths are generally relative to the currently opened document. If the current document is workshared, paths will be treated as relative to the central model. To create a ModelPath, use the derived classes FilePath , ServerPath, or use [!:Autodesk::Revit::DB::ModelPathUtils::ConvertCloudGUIDsToCloudPath(System::Guid, System::Guid)] for a cloud model path. The class ModelPathUtils contains utility functions for converting ModelPaths to and from strings.
See Also
Reference
Autodesk.Revit.DB Namespace